/**
 * 题目: 【GESP】C++一级练习 luogu-B2043, 判断能否被 3，5，7 整除
 * 题号: B2043
 * 归属: GESP1级
 * 博客: https://www.coderli.com/gesp-1-luogu-b2043/
 * 标准: C++11 (CCF GESP / CSP 官方规范)
 */

#include <iostream>
using namespace std;
int main() {
    int x; // 定义整数x
    cin >> x; // 从输入流中读取x的值
    // 判断x是否同时被3、5、7整除
    if (x % 3 == 0 && x % 5 == 0 && x % 7 == 0) {
        cout << "3 5 7"; // 如果x同时被3、5、7整除，则输出"3 5 7"
    } else if ((x % 3 == 0 && x % 5 == 0) && x % 7 != 0) {
        cout << "3 5"; // 如果x被3和5整除，但不被7整除，则输出"3 5"
    } else if ((x % 3 == 0 && x % 7 == 0) && x % 5 != 0) {
        cout << "3 7"; // 如果x被3和7整除，但不被5整除，则输出"3 7"
    } else if ((x % 5 == 0 && x % 7 == 0) && x % 3 != 0) {
        cout << "5 7"; // 如果x被5和7整除，但不被3整除，则输出"5 7"
    } else if ((x % 3 == 0 && x % 5 != 0) && x % 7 != 0) {
        cout << "3"; // 如果x被3整除，但不被5和7整除，则输出"3"
    } else if ((x % 3 != 0 && x % 5 == 0) && x % 7 != 0) {
        cout << "5"; // 如果x被5整除，但不被3和7整除，则输出"5"
    } else if ((x % 3 != 0 && x % 5 != 0) && x % 7 == 0) {
        cout << "7"; // 如果x被7整除，但不被3和5整除，则输出"7"
    } else {
        cout << "n"; // 如果x不被3、5、7任何一个整除，则输出"n"
    }
    return 0; // 返回0，表示程序执行成功
}
